; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_6)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 link10 link11 link12 link13 link14 - link
    angle0 angle40 angle80 angle120 angle160 angle200 angle240 angle280 angle320 - angle)
(:init
    (AngleOrd angle0 angle40)
    (AngleOrd angle40 angle80)
    (AngleOrd angle80 angle120)
    (AngleOrd angle120 angle160)
    (AngleOrd angle160 angle200)
    (AngleOrd angle200 angle240)
    (AngleOrd angle240 angle280)
    (AngleOrd angle280 angle320)
    (AngleOrd angle320 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)
    (IsChildOf link10 link9)
    (IsChildOf link11 link10)
    (IsChildOf link12 link11)
    (IsChildOf link13 link12)
    (IsChildOf link14 link13)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)
    (Affected link9 link1)
    (Affected link9 link2)
    (Affected link9 link3)
    (Affected link9 link4)
    (Affected link9 link5)
    (Affected link9 link6)
    (Affected link9 link7)
    (Affected link9 link8)
    (Affected link10 link1)
    (Affected link10 link2)
    (Affected link10 link3)
    (Affected link10 link4)
    (Affected link10 link5)
    (Affected link10 link6)
    (Affected link10 link7)
    (Affected link10 link8)
    (Affected link10 link9)
    (Affected link11 link1)
    (Affected link11 link2)
    (Affected link11 link3)
    (Affected link11 link4)
    (Affected link11 link5)
    (Affected link11 link6)
    (Affected link11 link7)
    (Affected link11 link8)
    (Affected link11 link9)
    (Affected link11 link10)
    (Affected link12 link1)
    (Affected link12 link2)
    (Affected link12 link3)
    (Affected link12 link4)
    (Affected link12 link5)
    (Affected link12 link6)
    (Affected link12 link7)
    (Affected link12 link8)
    (Affected link12 link9)
    (Affected link12 link10)
    (Affected link12 link11)
    (Affected link13 link1)
    (Affected link13 link2)
    (Affected link13 link3)
    (Affected link13 link4)
    (Affected link13 link5)
    (Affected link13 link6)
    (Affected link13 link7)
    (Affected link13 link8)
    (Affected link13 link9)
    (Affected link13 link10)
    (Affected link13 link11)
    (Affected link13 link12)
    (Affected link14 link1)
    (Affected link14 link2)
    (Affected link14 link3)
    (Affected link14 link4)
    (Affected link14 link5)
    (Affected link14 link6)
    (Affected link14 link7)
    (Affected link14 link8)
    (Affected link14 link9)
    (Affected link14 link10)
    (Affected link14 link11)
    (Affected link14 link12)
    (Affected link14 link13)

    (HasAngle angle0 link1)
    (HasAngle angle0 link2)
    (HasAngle angle120 link3)
    (HasAngle angle0 link4)
    (HasAngle angle320 link5)
    (HasAngle angle120 link6)
    (HasAngle angle160 link7)
    (HasAngle angle320 link8)
    (HasAngle angle280 link9)
    (HasAngle angle0 link10)
    (HasAngle angle240 link11)
    (HasAngle angle200 link12)
    (HasAngle angle280 link13)
    (HasAngle angle280 link14)
)
(:goal
(and
    (HasAngle angle160 link1)
    (HasAngle angle160 link2)
    (HasAngle angle80 link3)
    (HasAngle angle280 link4)
    (HasAngle angle40 link5)
    (HasAngle angle0 link6)
    (HasAngle angle320 link7)
    (HasAngle angle200 link8)
    (HasAngle angle120 link9)
    (HasAngle angle160 link10)
    (HasAngle angle240 link11)
    (HasAngle angle120 link12)
    (HasAngle angle200 link13)
    (HasAngle angle80 link14)
    )
)
)

; plan
1. (decrease_angle link3 angle120 angle80)
   deleted: (hasangle angle120 link3) (hasangle angle0 link4) (hasangle angle320 link5) (hasangle angle120 link6) (hasangle angle160 link7) (hasangle angle320 link8) (hasangle angle280 link9) (hasangle angle0 link10) (hasangle angle240 link11) (hasangle angle200 link12) (hasangle angle280 link13) (hasangle angle280 link14)
   added: (hasangle angle80 link3) (hasangle angle320 link4) (hasangle angle280 link5) (hasangle angle80 link6) (hasangle angle120 link7) (hasangle angle280 link8) (hasangle angle240 link9) (hasangle angle320 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle240 link14)
   goals met: 1 of 14
2. (decrease_angle link6 angle80 angle40)
   deleted: (hasangle angle80 link6) (hasangle angle120 link7) (hasangle angle280 link8) (hasangle angle240 link9) (hasangle angle320 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle240 link14)
   added: (hasangle angle40 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   goals met: 3 of 14
3. (decrease_angle link3 angle80 angle40)
   deleted: (hasangle angle80 link3) (hasangle angle320 link4) (hasangle angle280 link5) (hasangle angle40 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   added: (hasangle angle40 link3) (hasangle angle280 link4) (hasangle angle240 link5) (hasangle angle0 link6) (hasangle angle40 link7) (hasangle angle200 link8) (hasangle angle160 link9) (hasangle angle240 link10) (hasangle angle120 link11) (hasangle angle80 link12) (hasangle angle160 link13) (hasangle angle160 link14)
   goals met: 3 of 14
4. (increase_angle link1 angle0 angle40)
   deleted: (hasangle angle0 link1) (hasangle angle0 link2) (hasangle angle40 link3) (hasangle angle280 link4) (hasangle angle240 link5) (hasangle angle0 link6) (hasangle angle40 link7) (hasangle angle200 link8) (hasangle angle160 link9) (hasangle angle240 link10) (hasangle angle120 link11) (hasangle angle80 link12) (hasangle angle160 link13) (hasangle angle160 link14)
   added: (hasangle angle40 link1) (hasangle angle40 link2) (hasangle angle80 link3) (hasangle angle320 link4) (hasangle angle280 link5) (hasangle angle40 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   goals met: 3 of 14
5. (increase_angle link1 angle40 angle80)
   deleted: (hasangle angle40 link1) (hasangle angle40 link2) (hasangle angle80 link3) (hasangle angle320 link4) (hasangle angle280 link5) (hasangle angle40 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   added: (hasangle angle80 link1) (hasangle angle80 link2) (hasangle angle120 link3) (hasangle angle0 link4) (hasangle angle320 link5) (hasangle angle80 link6) (hasangle angle120 link7) (hasangle angle280 link8) (hasangle angle240 link9) (hasangle angle320 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle240 link14)
   goals met: 0 of 14
6. (decrease_angle link5 angle320 angle280)
   deleted: (hasangle angle320 link5) (hasangle angle80 link6) (hasangle angle120 link7) (hasangle angle280 link8) (hasangle angle240 link9) (hasangle angle320 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle240 link14)
   added: (hasangle angle280 link5) (hasangle angle40 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   goals met: 2 of 14
7. (increase_angle link1 angle80 angle120)
   deleted: (hasangle angle80 link1) (hasangle angle80 link2) (hasangle angle120 link3) (hasangle angle0 link4) (hasangle angle280 link5) (hasangle angle40 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   added: (hasangle angle120 link1) (hasangle angle120 link2) (hasangle angle160 link3) (hasangle angle40 link4) (hasangle angle320 link5) (hasangle angle80 link6) (hasangle angle120 link7) (hasangle angle280 link8) (hasangle angle240 link9) (hasangle angle320 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle240 link14)
   goals met: 0 of 14
8. (decrease_angle link4 angle40 angle0)
   deleted: (hasangle angle40 link4) (hasangle angle320 link5) (hasangle angle80 link6) (hasangle angle120 link7) (hasangle angle280 link8) (hasangle angle240 link9) (hasangle angle320 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle240 link14)
   added: (hasangle angle0 link4) (hasangle angle280 link5) (hasangle angle40 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   goals met: 2 of 14
9. (decrease_angle link11 angle160 angle120)
   deleted: (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   added: (hasangle angle120 link11) (hasangle angle80 link12) (hasangle angle160 link13) (hasangle angle160 link14)
   goals met: 0 of 14
10. (increase_angle link1 angle120 angle160)
   deleted: (hasangle angle120 link1) (hasangle angle120 link2) (hasangle angle160 link3) (hasangle angle0 link4) (hasangle angle280 link5) (hasangle angle40 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle120 link11) (hasangle angle80 link12) (hasangle angle160 link13) (hasangle angle160 link14)
   added: (hasangle angle160 link1) (hasangle angle160 link2) (hasangle angle200 link3) (hasangle angle40 link4) (hasangle angle320 link5) (hasangle angle80 link6) (hasangle angle120 link7) (hasangle angle280 link8) (hasangle angle240 link9) (hasangle angle320 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   goals met: 4 of 14
11. (decrease_angle link7 angle120 angle80)
   deleted: (hasangle angle120 link7) (hasangle angle280 link8) (hasangle angle240 link9) (hasangle angle320 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   added: (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle120 link11) (hasangle angle80 link12) (hasangle angle160 link13) (hasangle angle160 link14)
   goals met: 2 of 14
12. (increase_angle link5 angle320 angle0)
   deleted: (hasangle angle320 link5) (hasangle angle80 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle120 link11) (hasangle angle80 link12) (hasangle angle160 link13) (hasangle angle160 link14)
   added: (hasangle angle0 link5) (hasangle angle120 link6) (hasangle angle120 link7) (hasangle angle280 link8) (hasangle angle240 link9) (hasangle angle320 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   goals met: 4 of 14
13. (increase_angle link11 angle160 angle200)
   deleted: (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle200 link14)
   added: (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle240 link14)
   goals met: 2 of 14
14. (decrease_angle link14 angle240 angle200)
   deleted: (hasangle angle240 link14)
   added: (hasangle angle200 link14)
   goals met: 2 of 14
15. (increase_angle link11 angle200 angle240)
   deleted: (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle200 link14)
   added: (hasangle angle240 link11) (hasangle angle200 link12) (hasangle angle280 link13) (hasangle angle240 link14)
   goals met: 3 of 14
16. (decrease_angle link9 angle240 angle200)
   deleted: (hasangle angle240 link9) (hasangle angle320 link10) (hasangle angle240 link11) (hasangle angle200 link12) (hasangle angle280 link13) (hasangle angle240 link14)
   added: (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle200 link14)
   goals met: 2 of 14
17. (decrease_angle link14 angle200 angle160)
   deleted: (hasangle angle200 link14)
   added: (hasangle angle160 link14)
   goals met: 2 of 14
18. (increase_angle link11 angle200 angle240)
   deleted: (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle160 link14)
   added: (hasangle angle240 link11) (hasangle angle200 link12) (hasangle angle280 link13) (hasangle angle200 link14)
   goals met: 3 of 14
19. (decrease_angle link6 angle120 angle80)
   deleted: (hasangle angle120 link6) (hasangle angle120 link7) (hasangle angle280 link8) (hasangle angle200 link9) (hasangle angle280 link10) (hasangle angle240 link11) (hasangle angle200 link12) (hasangle angle280 link13) (hasangle angle200 link14)
   added: (hasangle angle80 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle240 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle160 link14)
   goals met: 2 of 14
20. (decrease_angle link14 angle160 angle120)
   deleted: (hasangle angle160 link14)
   added: (hasangle angle120 link14)
   goals met: 2 of 14
21. (decrease_angle link14 angle120 angle80)
   deleted: (hasangle angle120 link14)
   added: (hasangle angle80 link14)
   goals met: 3 of 14
22. (increase_angle link11 angle200 angle240)
   deleted: (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle80 link14)
   added: (hasangle angle240 link11) (hasangle angle200 link12) (hasangle angle280 link13) (hasangle angle120 link14)
   goals met: 3 of 14
23. (decrease_angle link7 angle80 angle40)
   deleted: (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle240 link10) (hasangle angle240 link11) (hasangle angle200 link12) (hasangle angle280 link13) (hasangle angle120 link14)
   added: (hasangle angle40 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle80 link14)
   goals met: 5 of 14
24. (increase_angle link1 angle160 angle200)
   deleted: (hasangle angle160 link1) (hasangle angle160 link2) (hasangle angle200 link3) (hasangle angle40 link4) (hasangle angle0 link5) (hasangle angle80 link6) (hasangle angle40 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle80 link14)
   added: (hasangle angle200 link1) (hasangle angle200 link2) (hasangle angle240 link3) (hasangle angle80 link4) (hasangle angle40 link5) (hasangle angle120 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle240 link10) (hasangle angle240 link11) (hasangle angle200 link12) (hasangle angle280 link13) (hasangle angle120 link14)
   goals met: 2 of 14
25. (decrease_angle link2 angle200 angle160)
   deleted: (hasangle angle200 link2) (hasangle angle240 link3) (hasangle angle80 link4) (hasangle angle40 link5) (hasangle angle120 link6) (hasangle angle80 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle240 link10) (hasangle angle240 link11) (hasangle angle200 link12) (hasangle angle280 link13) (hasangle angle120 link14)
   added: (hasangle angle160 link2) (hasangle angle200 link3) (hasangle angle40 link4) (hasangle angle0 link5) (hasangle angle80 link6) (hasangle angle40 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle80 link14)
   goals met: 4 of 14
26. (decrease_angle link3 angle200 angle160)
   deleted: (hasangle angle200 link3) (hasangle angle40 link4) (hasangle angle0 link5) (hasangle angle80 link6) (hasangle angle40 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle80 link14)
   added: (hasangle angle160 link3) (hasangle angle0 link4) (hasangle angle320 link5) (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle40 link14)
   goals met: 4 of 14
27. (decrease_angle link3 angle160 angle120)
   deleted: (hasangle angle160 link3) (hasangle angle0 link4) (hasangle angle320 link5) (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle40 link14)
   added: (hasangle angle120 link3) (hasangle angle320 link4) (hasangle angle280 link5) (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle120 link8) (hasangle angle40 link9) (hasangle angle120 link10) (hasangle angle120 link11) (hasangle angle80 link12) (hasangle angle160 link13) (hasangle angle0 link14)
   goals met: 3 of 14
28. (increase_angle link5 angle280 angle320)
   deleted: (hasangle angle280 link5) (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle120 link8) (hasangle angle40 link9) (hasangle angle120 link10) (hasangle angle120 link11) (hasangle angle80 link12) (hasangle angle160 link13) (hasangle angle0 link14)
   added: (hasangle angle320 link5) (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle40 link14)
   goals met: 4 of 14
29. (increase_angle link11 angle160 angle200)
   deleted: (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle40 link14)
   added: (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle80 link14)
   goals met: 3 of 14
30. (increase_angle link14 angle80 angle120)
   deleted: (hasangle angle80 link14)
   added: (hasangle angle120 link14)
   goals met: 2 of 14
31. (decrease_angle link6 angle40 angle0)
   deleted: (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle120 link14)
   added: (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle120 link8) (hasangle angle40 link9) (hasangle angle120 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   goals met: 6 of 14
32. (decrease_angle link13 angle200 angle160)
   deleted: (hasangle angle200 link13) (hasangle angle80 link14)
   added: (hasangle angle160 link13) (hasangle angle40 link14)
   goals met: 4 of 14
33. (increase_angle link5 angle320 angle0)
   deleted: (hasangle angle320 link5) (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle120 link8) (hasangle angle40 link9) (hasangle angle120 link10) (hasangle angle160 link11) (hasangle angle120 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   added: (hasangle angle0 link5) (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle160 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   goals met: 4 of 14
34. (decrease_angle link12 angle160 angle120)
   deleted: (hasangle angle160 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   added: (hasangle angle120 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   goals met: 3 of 14
35. (increase_angle link8 angle160 angle200)
   deleted: (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle120 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   added: (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle160 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   goals met: 6 of 14
36. (decrease_angle link1 angle200 angle160)
   deleted: (hasangle angle200 link1) (hasangle angle160 link2) (hasangle angle120 link3) (hasangle angle320 link4) (hasangle angle0 link5) (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle160 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   added: (hasangle angle160 link1) (hasangle angle120 link2) (hasangle angle80 link3) (hasangle angle280 link4) (hasangle angle320 link5) (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle120 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   goals met: 7 of 14
37. (increase_angle link2 angle120 angle160)
   deleted: (hasangle angle120 link2) (hasangle angle80 link3) (hasangle angle280 link4) (hasangle angle320 link5) (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle120 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   added: (hasangle angle160 link2) (hasangle angle120 link3) (hasangle angle320 link4) (hasangle angle0 link5) (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle160 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   goals met: 7 of 14
38. (decrease_angle link3 angle120 angle80)
   deleted: (hasangle angle120 link3) (hasangle angle320 link4) (hasangle angle0 link5) (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle160 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   added: (hasangle angle80 link3) (hasangle angle280 link4) (hasangle angle320 link5) (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle120 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   goals met: 8 of 14
39. (increase_angle link5 angle320 angle0)
   deleted: (hasangle angle320 link5) (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle120 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   added: (hasangle angle0 link5) (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle160 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   goals met: 9 of 14
40. (decrease_angle link6 angle40 angle0)
   deleted: (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle160 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   added: (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle120 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   goals met: 8 of 14
41. (increase_angle link8 angle160 angle200)
   deleted: (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle120 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   added: (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle160 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   goals met: 11 of 14
42. (decrease_angle link6 angle0 angle320)
   deleted: (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle160 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   added: (hasangle angle320 link6) (hasangle angle280 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle120 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   goals met: 6 of 14
43. (increase_angle link13 angle160 angle200)
   deleted: (hasangle angle160 link13) (hasangle angle40 link14)
   added: (hasangle angle200 link13) (hasangle angle80 link14)
   goals met: 8 of 14
44. (increase_angle link5 angle0 angle40)
   deleted: (hasangle angle0 link5) (hasangle angle320 link6) (hasangle angle280 link7) (hasangle angle160 link8) (hasangle angle80 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   added: (hasangle angle40 link5) (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle120 link14)
   goals met: 10 of 14
45. (decrease_angle link12 angle160 angle120)
   deleted: (hasangle angle160 link12) (hasangle angle240 link13) (hasangle angle120 link14)
   added: (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   goals met: 13 of 14
46. (decrease_angle link10 angle200 angle160)
   deleted: (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   added: (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle80 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   goals met: 10 of 14
47. (increase_angle link11 angle200 angle240)
   deleted: (hasangle angle200 link11) (hasangle angle80 link12) (hasangle angle160 link13) (hasangle angle40 link14)
   added: (hasangle angle240 link11) (hasangle angle120 link12) (hasangle angle200 link13) (hasangle angle80 link14)
   goals met: 14 of 14
